sample/all/swarm-sn-wrk-mixed-c6525-25g-exp14-havail0-hori0-verti1-infi1-client1-t4-c512-d30-R4000
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=4000
Running 30s test @ http://10.10.1.8:8080
  4 threads and 512 connections
  Thread calibration: mean lat.: 1544.247ms, rate sampling interval: 7249ms
  Thread calibration: mean lat.: 1588.365ms, rate sampling interval: 7299ms
  Thread calibration: mean lat.: 1529.563ms, rate sampling interval: 6836ms
  Thread calibration: mean lat.: 1605.883ms, rate sampling interval: 7077ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.35s     3.30s   15.22s    65.54%
    Req/Sec   599.88     20.05   631.00     62.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.08s 
 75.000%    9.60s 
 90.000%   11.98s 
 99.000%   15.22s 
 99.900%   16.91s 
 99.990%   18.51s 
 99.999%   18.81s 
100.000%   18.81s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.934     0.000000            1         1.00
    3223.551     0.100000         4736         1.11
    4358.143     0.200000         9474         1.25
    5324.799     0.300000        14222         1.43
    6193.151     0.400000        18950         1.67
    7077.887     0.500000        23690         2.00
    7548.927     0.550000        26066         2.22
    8032.255     0.600000        28422         2.50
    8527.871     0.650000        30804         2.86
    9027.583     0.700000        33168         3.33
    9601.023     0.750000        35542         4.00
    9928.703     0.775000        36709         4.44
   10272.767     0.800000        37907         5.00
   10657.791     0.825000        39093         5.71
   11059.199     0.850000        40258         6.67
   11485.183     0.875000        41445         8.00
   11730.943     0.887500        42048         8.89
   11984.895     0.900000        42628        10.00
   12238.847     0.912500        43241        11.43
   12492.799     0.925000        43819        13.33
   12795.903     0.937500        44411        16.00
   12967.935     0.943750        44702        17.78
   13156.351     0.950000        44999        20.00
   13369.343     0.956250        45288        22.86
   13623.295     0.962500        45592        26.67
   13860.863     0.968750        45883        32.00
   13991.935     0.971875        46034        35.56
   14155.775     0.975000        46178        40.00
   14393.343     0.978125        46324        45.71
   14606.335     0.981250        46472        53.33
   14761.983     0.984375        46621        64.00
   14876.671     0.985938        46695        71.11
   14983.167     0.987500        46769        80.00
   15138.815     0.989062        46846        91.43
   15278.079     0.990625        46919       106.67
   15400.959     0.992188        46991       128.00
   15515.647     0.992969        47030       142.22
   15622.143     0.993750        47064       160.00
   15794.175     0.994531        47101       182.86
   15925.247     0.995313        47139       213.33
   16072.703     0.996094        47175       256.00
   16171.007     0.996484        47193       284.44
   16293.887     0.996875        47212       320.00
   16408.575     0.997266        47230       365.71
   16490.495     0.997656        47251       426.67
   16531.455     0.998047        47267       512.00
   16556.031     0.998242        47277       568.89
   16596.991     0.998437        47288       640.00
   16629.759     0.998633        47295       731.43
   16793.599     0.998828        47304       853.33
   16908.287     0.999023        47313      1024.00
   17039.359     0.999121        47319      1137.78
   17104.895     0.999219        47323      1280.00
   17186.815     0.999316        47327      1462.86
   17235.967     0.999414        47333      1706.67
   17285.119     0.999512        47337      2048.00
   17317.887     0.999561        47339      2275.56
   17350.655     0.999609        47344      2560.00
   17350.655     0.999658        47344      2925.71
   17547.263     0.999707        47346      3413.33
   17809.407     0.999756        47348      4096.00
   17940.479     0.999780        47349      4551.11
   18317.311     0.999805        47350      5120.00
   18350.079     0.999829        47351      5851.43
   18513.919     0.999854        47354      6826.67
   18513.919     0.999878        47354      8192.00
   18513.919     0.999890        47354      9102.22
   18563.071     0.999902        47355     10240.00
   18563.071     0.999915        47355     11702.86
   18579.455     0.999927        47356     13653.33
   18743.295     0.999939        47357     16384.00
   18743.295     0.999945        47357     18204.44
   18743.295     0.999951        47357     20480.00
   18743.295     0.999957        47357     23405.71
   18808.831     0.999963        47359     27306.67
   18808.831     1.000000        47359          inf
#[Mean    =     7350.476, StdDeviation   =     3297.572]
#[Max     =    18792.448, Total count    =        47359]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  72598 requests in 30.02s, 509.76MB read
  Non-2xx or 3xx responses: 11988
Requests/sec:   2418.53
Transfer/sec:     16.98MB